<template>
  <div>
1949年 - 東京都にて誕生。
1969年 - 東京教育大学附属駒場高等学校卒業[3]。
1971年 - 慶應義塾大学法学部中退。
1978年 - 自治医科大学医学部卒業[3]。
1987年 - 自治医科大学医学部助手[3]。
1990年 - 世界保健機関西太平洋地域事務局感染症対策部部長[3]。
1999年 - 世界保健機関西太平洋地域事務局事務局長[3]。
2006年 - 世界保健機関事務局長選挙候補者（日本国政府が擁立／落選）[1][5][6][7]。
2009年 - 自治医科大学地域医療学センター教授[3]。
2009年 - 世界保健機関執行理事[3]。
2012年 - 年金・健康保険福祉施設整理機構理事長[3]。
2012年 - 新型インフルエンザ等対策閣僚会議新型インフルエンザ等対策有識者会議会長。
2013年 - 世界保健総会会長[11]。
2013年 - 国立国際医療研究センター顧問[3]。
2014年 - 地域医療機能推進機構理事長[3]。
2016年 - 国際連合国際的な公衆衛生危機対応タスクフォース委員[3]。
2020年 - 新型コロナウイルス感染症対策本部新型コロナウイルス感染症対策専門家会議副座長[13][14]。
2020年 - 新型インフルエンザ等対策閣僚会議新型インフルエンザ等対策有識者会議新型コロナウイルス感染症対策分科会長[18]。
  </div>
</template>

<script lang="ts">
// 個人キャリアリスト
// 未作成
import { PropType } from 'vue'
import { ref, toRefs, useFetch, defineComponent } from '@nuxtjs/composition-api';

export default defineComponent({
  name: 'PersonCareerList',
  props: {
    personId: {
      type: String,
      required: true,
    },
  },
  setup(props, { root }) {
    console.log('personId', props.personId)
    return {
    };
  },
});
</script>
